01  WS-AREA. 
    05  WS-NUMBER PIC 9(5) VALUE 99999. 
    05  WS-NUMBER2 PIC 9(5) VALUE 1. 

    PROCEDURE DIVISION.
        COMPUTE WS-NUMBER = WS-NUMBER / WS-NUMBER2
        DISPLAY WS-NUMBER
        STOP RUN.